Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterBase Methods
The AnalysisDesignParameterBase type exposes the following members.
Methods
Name | Description
Modify
 Modifies an analysis design parameter at the database. Inserts if parameter does not exist.
Select
 Selects an analysis object from the database.
 (Inherited from AnalysisObject.)
Top
See Also
Reference
AnalysisDesignParameterBase Class
Tekla.Structures.Analysis Namespace